app/Controllers/Api/ApiDataPelamar.php

UPDATE `datapelamar` SET `alamat` = 'asd', `telepon` = '04814351', `id_user` = '1', `tanggal_lahir` = '2017-11-09', `updated_at` = '2023-11-09 05:12:46'
WHERE `id_user` = '1'
---
	public function create()
	{
		if( !$this->validate([
			'alamat' 	=> 'required',
			'telepon' 	=> 'required',
			'id_user'	   	=> 'required',
			'tanggal_lahir'	   	=> 'required',

		]))
		{
			return $this->response->setJSON(['success' => false, 'data' => null, "message" => \Config\Services::validation()->getErrors()]);
		}
		$id =  $this->request->getVar('id_user');
		$insert = [
            'alamat' => $this->request->getVar('alamat'),
			'telepon' => $this->request->getVar('telepon'),
			'id_user' => $id,
			'tanggal_lahir' => $this->request->getVar('tanggal_lahir'),

        ];

		$db = new MdlDataPelamar;
			$messages = "Gagal";

		if ($db->where('id_user',$id)->countAll() >0 ) {
			$save  = $db->where('id_user',$id)->set($insert)->update();