app/Controllers/Api/ApiJob.php

public function page()
{
    $db = new MdlJob;
    $page = $_GET['page'] ?? 1;
    $size = $_GET['size'] ?? 3;
    $s = $_GET['s'] ?? '';

    $offset = ($page - 1) * $size;

    // Mengganti spasi dengan +
    $s = str_replace('+', ' ', $s);

    if ($s !== '') {
        // var_dump($s);die();
        $query = $db
            ->groupStart()
                ->like('job', $s)
                ->orLike('job_desc', $s)
            ->groupEnd()
            ->orderBy('id', 'DESC');

    } else {
        $query = $db->orderBy('id', 'DESC');
    }

    // Clone query before pagination
    $countQuery = clone $query;
    $totalElements = $countQuery->countAllResults(false);

    $data = $query->paginate($size, 'default', $offset);
---
SELECT COUNT(*) AS `numrows`
FROM `job`
WHERE   (
`job` LIKE '%pen%' ESCAPE '!'
OR  `job_desc` LIKE '%pen%' ESCAPE '!'
 )
SELECT *
FROM `job`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `job`