app/Controllers/Api/ApiPendidikanPelamar.php

	public function create()
	{
		if( !$this->validate([
			'jenjang' 	=> 'required',
			'lembaga' 	=> 'required',
			'tahun_lulus' 	=> 'required',
			'id_user'	   	=> 'required',

		]))
		{
			return $this->response->setJSON(['success' => false, 'data' => null, "message" => \Config\Services::validation()->getErrors()]);
		}

		$insert = [
            'jenjang' => $this->request->getVar('jenjang'),
			'lembaga' => $this->request->getVar('lembaga'),
			'tahun_lulus' => $this->request->getVar('tahun_lulus'),
			'id_user' => $this->request->getVar('id_user'),

        ];

		$db = new MdlDataPendidikanPelamar;
		$save  = $db->insert($insert);
---
INSERT INTO `pendidikanpelamar` (`jenjang`, `lembaga`, `tahun_lulus`, `id_user`, `created_at`, `updated_at`) VALUES ('SD', 'asd', '3123', '1', '2023-11-10 03:59:45', '2023-11-10 03:59:45')