app/Controllers/Api/ApiPendidikanPelamar.php

UPDATE `pendidikanpelamar` SET `jenjang` = 'SD', `lembaga` = 'asd', `tahun_lulus` = '3123', `id_user` = '1', `updated_at` = '2023-11-10 03:59:45'
WHERE `id_user` = '1'
AND `jenjang` = 'SD'
---
	public function create()
	{
		if( !$this->validate([
			'jenjang' 	=> 'required',
			'lembaga' 	=> 'required',
			'tahun_lulus' 	=> 'required',
			'id_user'	   	=> 'required',

		]))
		{
			return $this->response->setJSON(['success' => false, 'data' => null, "message" => \Config\Services::validation()->getErrors()]);
		}

		$id = $this->request->getVar('id_user');
		$jenjang = $this->request->getVar('jenjang');
		$insert = [
            'jenjang' => $jenjang,
			'lembaga' => $this->request->getVar('lembaga'),
			'tahun_lulus' => $this->request->getVar('tahun_lulus'),
			'id_user' => $id,

        ];

		$db = new MdlDataPendidikanPelamar;
		// $save  = $db->insert($insert);

		$messages = "Gagal";

		if ($db->where(array('id_user'=>$id, 'jenjang'=>$jenjang))->countAllResults() >0 ) {
			$save  = $db->where(array('id_user'=>$id, 'jenjang'=>$jenjang))->set($insert)->update();