app/Controllers/Api/ResourceFile.php

SELECT *
FROM `filecv`
WHERE `id_user` = '1'
---
	    public function show($id_user=null)
    {
    	$db = new MdlFilecv();
    	$filename = $db->where('id_user', $id_user)->get()->getResultArray();