app/Controllers/Api/ResourceFile.php

SELECT *
FROM `filecv`
WHERE `id_user` = '1'
UPDATE `filecv` SET `name` = '19609647221698615335.ai', `updated_at` = '2023-10-29 21:35:35'
WHERE `id_user` = '1'
---
	public function updateCvUser($id)
	{
		$file = $this->request->getFile('file_cv');

		$profile_image = $file->getName();

		// Renaming file before upload
		$temp = explode(".",$profile_image);
		$newfilename = rand().round(microtime(true)) . '.' . end($temp);

		if ($file->move("file/user", $newfilename)) {

			$fileModel = new MdlFilecv();

			$data = [
				"name" => $newfilename
			];
			$newdata = [
				'id_user'=>$id,
				"name" => $newfilename
			];
			if ($fileModel->where('id_user',$id)->get()->getNumRows() >0) {
				$oldfile = $fileModel->where('id_user',$id)->get()->getResultArray()[0]['name'];

				if ($fileModel->set($data)->where('id_user',$id)->update()) {